export const getPersianNumberWord = (index: number): string => {
    const words: any[] = [
        "اول", "دوم", "سوم", "چهارم", "پنجم", "ششم", "هفتم", "هشتم", "نهم", "دهم",
        "یازدهم", "دوازدهم", "سیزدهم", "چهاردهم", "پانزدهم", "شانزدهم", "هفدهم", "هجدهم", "نوزدهم", "بیستم",
        "بیست و یکم", "بیست و دوم", "بیست و سوم", "بیست و چهارم", "بیست و پنجم", "بیست و ششم", "بیست و هفتم", "بیست و هشتم", "بیست و نهم", "سی‌ام",
        "سی و یکم", "سی و دوم", "سی و سوم", "سی و چهارم", "سی و پنجم", "سی و ششم", "سی و هفتم", "سی و هشتم", "سی و نهم", "چهلم",
        "چهل و یکم", "چهل و دوم", "چهل و سوم", "چهل و چهارم", "چهل و پنجم", "چهل و ششم", "چهل و هفتم", "چهل و هشتم", "چهل و نهم", "پنجاهم",
        "پنجاه و یکم", "پنجاه و دوم", "پنجاه و سوم", "پنجاه و چهارم", "پنجاه و پنجم", "پنجاه و ششم", "پنجاه و هفتم", "پنجاه و هشتم", "پنجاه و نهم", "شصتم",
        "شصت و یکم", "شصت و دوم", "شصت و سوم", "شصت و چهارم", "شصت و پنجم", "شصت و ششم", "شصت و هفتم", "شصت و هشتم", "شصت و نهم", "هفتادم",
        "هفتاد و یکم", "هفتاد و دوم", "هفتاد و سوم", "هفتاد و چهارم", "هفتاد و پنجم", "هفتاد و ششم", "هفتاد و هفتم", "هفتاد و هشتم", "هفتاد و نهم", "هشتادم",
        "هشتاد و یکم", "هشتاد و دوم", "هشتاد و سوم", "هشتاد و چهارم", "هشتاد و پنجم", "هشتاد و ششم", "هشتاد و هفتم", "هشتاد و هشتم", "هشتاد و نهم", "نودم",
        "نود و یکم", "نود و دوم", "نود و سوم", "نود و چهارم", "نود و پنجم", "نود و ششم", "نود و هفتم", "نود و هشتم", "نود و نهم", "صدم"
    ];

    if (index >= 0 && index < words.length) {
        return words[index];
    }
    return `${index + 1}ام`;
};